{
  "architectures": [
    "Lfm2ForCausalLM"
  ],
  "block_auto_adjust_ff_dim": true,
  "block_dim": 1536,
  "block_ff_dim": 10240,
  "block_ffn_dim_multiplier": 1.0,
  "block_mlp_init_scale": 1.0,
  "block_multiple_of": 256,
  "block_norm_eps": 1e-05,
  "block_out_init_scale": 1.0,
  "block_use_swiglu": true,
  "block_use_xavier_init": true,
  "bos_token_id": 1,
  "conv_L_cache": 3,
  "conv_bias": false,
  "conv_dim": 1536,
  "conv_dim_out": 1536,
  "conv_use_xavier_init": true,
  "eos_token_id": 7,
  "full_attn_idxs": [
    2,
    5,
    8,
    10,
    12,
    14
  ],
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "max_position_embeddings": 128000,
  "model_type": "lfm2",
  "norm_eps": 1e-05,
  "num_attention_heads": 24,
  "num_heads": 24,
  "num_hidden_layers": 16,
  "num_key_value_heads": 8,
  "pad_token_id": 0,
  "rope_theta": 1000000.0,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.54.0.dev0",
  "use_cache": true,
  "use_pos_enc": true,
  "vocab_size": 65536
}
