{
  "architectures": ["Qwen3_5ForCausalLM"],
  "model_type": "qwen3_5",

  "vocab_size":           151936,
  "hidden_size":          1536,
  "intermediate_size":    8960,
  "num_hidden_layers":    28,
  "num_attention_heads":  16,
  "num_key_value_heads":  8,
  "head_dim":             128,

  "max_position_embeddings": 40960,
  "rope_theta":           1000000.0,
  "rms_norm_eps":         1e-6,

  "tie_word_embeddings":  true,
  "hidden_act":           "silu",
  "initializer_range":    0.02,

  "eos_token_id":         151645,
  "bos_token_id":         151643,
  "pad_token_id":         151643,

  "_comment": "Placeholder – replace with values from the actual Qwen3.5-2B config.json"
}
