{
    "model_type": "embedding",
    "architectures" : "GLiner2MultiV1",
    "model_tensor_type": "FP32-FP32",
    "encoder_model_file_name": "nntr_mdeberta_v3_fp32.bin",
    "model_file_name": "nntr_gliner2_multi_v1_fp32.bin",
    "fc_layer_dtype": "FP32",
    "embedding_dtype": "FP32",
    "lora_rank": 0,
    "lora_alpha": 0,
    "lora_target": [],
    "bad_word_ids": [],
    "fsu": false,
    "fsu_lookahead": 2,
    "num_to_generate": 512,
    "init_seq_len": 512,
    "max_seq_len": 512,
    "batch_size": 1,
    "tokenizer_file": "/tmp/nntrainer/Applications/CausalLM/res/gliner2-multi-v1/tokenizer.json",
    "task": "EntityExtraction",
    "sample_input": "Cristiano Ronaldo dos Santos Aveiro (Portuguese pronunciation: [kɾiʃˈtjɐnu ʁɔˈnaldu]; born 5 February 1985) is a Portuguese professional footballer who plays as a forward for and captains both Saudi Pro League club Al Nassr and the Portugal national team. Widely regarded as one of the greatest players of all time, Ronaldo has won five Ballon d'Or awards,[note 3] a record three UEFA Men's Player of the Year Awards, and four European Golden Shoes, the most by a European player. He has won 33 trophies in his career, including seven league titles, five UEFA Champions Leagues, the UEFA European Championship and the UEFA Nations League. Ronaldo holds the records for most appearances (183), goals (140) and assists (42) in the Champions League, goals in the European Championship (14), international goals (128) and international appearances (205). He is one of the few players to have made over 1,200 professional career appearances, the most by an outfield player, and has scored over 850 official senior career goals for club and country, making him the top goalscorer of all time.",
    "labels": [
        "Person", "Organization", "Location", "Date", "Award", "Competitions", "Teams"
    ]
}
